[
  {"id":"Albers2023Beirut","abstract":"\"Beirut und die Zeitschrift <i>Mawaqif</i>\" published on 09 Oct 2023 by Brill | Fink.","accessed":{"date-parts":[[2023,4,16]]},"author":[{"family":"Albers","given":"Yvonne"}],"citation-key":"Albers2023Beirut","event-place":"Paderborn","ISBN":"978-3-8467-6663-7","issued":{"date-parts":[[2023,10,9]]},"language":"de","publisher":"Brill Fink","publisher-place":"Paderborn","source":"www.fink.de","title":"Beirut und die Zeitschrift <i>Mawaqif</i>: Eine arabische Intellektuellengeschichte, 1968–1994","title-short":"Beirut und die Zeitschrift Mawaqif","type":"book"},
  {"id":"AlfaifiAtwell2016ComparativeEvaluationTools","abstract":"As the number of Arabic corpora is constantly increasing, there is an obvious and growing need for concordancing software for corpus search and analysis that supports as many features as possible of the Arabic language, and provides users with a greater number of functions. This paper evaluates six existing corpus search and analysis tools based on eight criteria which seem to be the most essential for searching and analysing Arabic corpora, such as displaying Arabic text in its right-to-left direction, normalising diacritics and Hamza, and providing an Arabic user interface. The results of the evaluation revealed that three tools: Khawas, Sketch Engine, and aConCorde, have met most of the evaluation criteria and achieved the highest benchmark scores. The paper concluded that developers’ conscious consideration of the linguistic features of Arabic when designing these three tools was the most significant factor behind their superiority.","accessed":{"date-parts":[[2023,1,25]]},"author":[{"family":"Alfaifi","given":"Abdullah"},{"family":"Atwell","given":"Eric"}],"citation-key":"AlfaifiAtwell2016ComparativeEvaluationTools","container-title":"International Journal of Speech Technology","container-title-short":"Int J Speech Technol","DOI":"10.1007/s10772-015-9285-5","ISSN":"1572-8110","issue":"2","issued":{"date-parts":[[2016,6,1]]},"language":"en","page":"347-357","source":"Springer Link","title":"Comparative evaluation of tools for Arabic corpora search and analysis","type":"article-journal","URL":"https://doi.org/10.1007/s10772-015-9285-5","volume":"19"},
  {"id":"Alghamdi.Teahan+2017+ExperimentalEvaluationArabic","abstract":"Purpose The aim of this paper is to experimentally evaluate the effectiveness of the state-of-the-art printed Arabic text recognition systems to determine open areas for future improvements. In addition, this paper proposes a standard protocol with a set of metrics for measuring the effectiveness of Arabic optical character recognition (OCR) systems to assist researchers in comparing different Arabic OCR approaches. Design/methodology/approach This paper describes an experiment to automatically evaluate four well-known Arabic OCR systems using a set of performance metrics. The evaluation experiment is conducted on a publicly available printed Arabic dataset comprising 240 text images with a variety of resolution levels, font types, font styles and font sizes. Findings The experimental results show that the field of character recognition for printed Arabic still requires further research to reach an efficient text recognition method for Arabic script. Originality/value To the best of the authors’ knowledge, this is the first work that provides a comprehensive automated evaluation of Arabic OCR systems with respect to the characteristics of Arabic script and, in addition, proposes an evaluation methodology that can be used as a benchmark by researchers and therefore will contribute significantly to the enhancement of the field of Arabic script recognition.","accessed":{"date-parts":[[2021,2,23]]},"author":[{"family":"Alghamdi","given":"Mansoor"},{"family":"Teahan","given":"William"}],"citation-key":"Alghamdi.Teahan+2017+ExperimentalEvaluationArabic","container-title":"PSU Research Review","DOI":"10/gh4457","ISSN":"2399-1747","issue":"3","issued":{"date-parts":[[2017]]},"note":"https://web.archive.org/web/20210902092554/https://www.emerald.com/insight/content/doi/10.1108/PRR-05-2017-0026/full/html","number":"3","page":"229-241","publisher":"Emerald Publishing Limited","source":"Emerald Insight","title":"Experimental evaluation of Arabic OCR systems","type":"article-journal","URL":"https://doi.org/10.1108/PRR-05-2017-0026","volume":"1"},
  {"id":"Azzi2020LinguisticImperialismAttitudes","abstract":"Attitudes towards the teaching and learning of English in Lebanon continue to develop as individuals feel the need to acquire the language and gain increased fluency. The objective of this study is to provide a critical learning environment where students at a private university in Beirut discussed their beliefs pertaining to the English language and, using critical applied linguistics, assessed the impact of the dominance of English on their particular social context. Using dialogue and reflexivity, in addition to creating a participatory environment, this study covers a semester of teaching the Advanced Academic English class as students conducted their individual research. Data was collected through an initial introductory session, analysis of the students’ papers, and a final survey. For the most part, students were motivated to work in the course as they considered the topic extremely important; however, their attitudes towards English, and its perceived hegemony, did not necessarily lead to a change in the way they would continue to learn the language.","accessed":{"date-parts":[[2022,1,30]]},"author":[{"family":"Azzi","given":"Reine"}],"citation-key":"Azzi2020LinguisticImperialismAttitudes","container-title":"Critical Issues in Teaching English and Language Education: International Research Perspectives","DOI":"10.1007/978-3-030-53297-0_5","editor":[{"family":"Troudi","given":"Salah"}],"event-place":"Cham","ISBN":"978-3-030-53297-0","issued":{"date-parts":[[2020]]},"language":"en","page":"97-122","publisher":"Springer International Publishing","publisher-place":"Cham","source":"Springer Link","title":"Linguistic Imperialism and Attitudes Towards Learning English in Lebanon: An Exercise in Critical Pedagogy","title-short":"Linguistic Imperialism and Attitudes Towards Learning English in Lebanon","type":"chapter"},
  {"id":"BarringerWallace2014AfricanStudies","citation-key":"BarringerWallace2014AfricanStudies","DOI":"10.1163/9789004279148","editor":[{"family":"Barringer","given":"Terry"},{"family":"Wallace","given":"Marion"}],"event-place":"Leiden","ISBN":"978-90-04-27230-9","issued":{"date-parts":[[2014,7]]},"language":"en","publisher":"Brill","publisher-place":"Leiden","title":"African studies in the digital age","type":"book"},
  {"id":"Bauer1996Arabic","author":[{"family":"Bauer","given":"Thomas"}],"citation-key":"Bauer1996Arabic","container-title":"The world's writing systems","editor":[{"family":"Bright","given":"William"},{"family":"Daniels","given":"Peter T."}],"event-place":"New York","ISBN":"978-0-19-507993-7","issued":{"date-parts":[[1996]]},"language":"eng","note":"OCLC: 832565390\ndate_read: 2023-03-02","page":"559-563","publisher":"Oxford University Press","publisher-place":"New York","title":"Arabic Writing","type":"chapter"},
  {"id":"BCP47","accessed":{"date-parts":[[2023,1,30]]},"author":[{"literal":"Network Working Group"}],"citation-key":"BCP47","editor":[{"literal":"A. Phillips"},{"literal":"M. Davis"}],"issued":{"date-parts":[[2009,9]]},"language":"en","publisher":"IETF Trust","title":"BCP 47: Tags for Identifying Languages","title-short":"BCP 47","type":"document","URL":"https://www.ietf.org/rfc/bcp/bcp47.txt"},
  {"id":"Becker1987ArabicWordProcessing","abstract":"Recently developed word processing software can correctly format the cursive, interacting letters of the Arabic script. Moreover, new layout procedures can automatically intermix right-to-left Arabic writing with left-to-right text in European or other languages.","accessed":{"date-parts":[[2023,1,25]]},"author":[{"family":"Becker","given":"Joseph D."}],"citation-key":"Becker1987ArabicWordProcessing","container-title":"Communications of the ACM","container-title-short":"Commun. ACM","DOI":"10.1145/28569.28570","ISSN":"0001-0782","issue":"7","issued":{"date-parts":[[1987,7,1]]},"page":"600–610","source":"July 1987","title":"Arabic word processing","type":"article-journal","URL":"https://doi.org/10.1145/28569.28570","volume":"30"},
  {"id":"Bergenthum2014AfricanNewspapersOnline","author":[{"family":"Bergenthum","given":"Hartmut"}],"citation-key":"Bergenthum2014AfricanNewspapersOnline","container-title":"African studies in the digital age","DOI":"10.1163/9789004279148_012","editor":[{"family":"Barringer","given":"Terry"},{"family":"Wallace","given":"Marion"}],"event-place":"Leiden","ISBN":"978-90-04-27230-9","issued":{"date-parts":[[2014,7]]},"language":"en","page":"195-2020","publisher":"Brill","publisher-place":"Leiden","title":"African Newspapers in the Online World: Information Gains and Losses","type":"chapter"},
  {"id":"Bondarev+2019+IntroductionOrthographicPolyphony","abstract":"Manuscript cultures based on Arabic script feature various tendencies in standardisation of orthography, script types and layout. Unlike previous studies, this book steps outside disciplinary and regional boundaries and provides a typological cross-cultural comparison of standardisation processes in twelve Arabic-influenced writing traditions where different cultures, languages and scripts interact. A wide range of case studies give insights into the factors behind uniformity and variation in Judeo-Arabic in Hebrew script, South Palestinian Christian Arabic, New Persian, Aljamiado of the Spanish Moriscos, Ottoman Turkish, a single multilingual Ottoman manuscript, Sino-Arabic in northwest China, Malay Jawi in the Moluccas, Kanuri and Hausa in Nigeria, Kabyle in Algeria, and Ethiopian Fidäl script as used to transliterate Arabic. One of the findings of this volume is that different domains of manuscript cultures have distinct paths of standardisation, so that orthography tends to develop its own standardisation principles irrespective of norms applied to layout and script types. This book will appeal to readers interested in manuscript studies, sociolinguistics, literacy studies, and history of writing.","accessed":{"date-parts":[[2021,6,25]]},"author":[{"family":"Bondarev","given":"Dmitry"}],"citation-key":"Bondarev+2019+IntroductionOrthographicPolyphony","collection-number":"16","collection-title":"Studies in Manuscript Cultures","container-title":"Creating Standards: Interactions with Arabic script in 12 manuscript cultures","DOI":"10.1515/9783110639063-001","editor":[{"family":"Bondarev","given":"Dmitry"},{"family":"Gori","given":"Alessandro"},{"family":"Souag","given":"Lameen"}],"ISBN":"978-3-11-063906-3","issued":{"date-parts":[[2019,4,15]]},"language":"en","license":"CC BY-NC-ND 4.0","publisher":"De Gruyter","source":"www.degruyter.com","title":"Introduction: Orthographic Polyphony in Arabic Script","type":"chapter","URL":"https://www.degruyter.com/document/doi/10.1515/9783110639063-001/html"},
  {"id":"Dombrowski2022MultilingualDigitalHumanities","author":[{"family":"Dombrowski","given":"Quinn"}],"citation-key":"Dombrowski2022MultilingualDigitalHumanities","container-title":"The Bloomsbury Handbook to the Digital Humanities","DOI":"10.5040/9781350232143.ch-13","editor":[{"family":"O’Sullivan","given":"James"}],"issued":{"date-parts":[[2022,11,3]]},"language":"en","page":"137–146","publisher":"Bloomsbury","title":"Does Coding Matter for Doing Digital Humanities?","type":"chapter"},
  {"id":"DuganMontpellier2021MultipleScripts","abstract":"This paper outlines our methodology for regularizing the transliteration of Urdu-based discourse in digital spaces for analysis with various DH methods. Scholars, acknowledging social media as an increasingly central discursive space and the irregularity of Urdu-based online transliterations, have taken generative steps in this regard (Irvine and Ann 2012, Sharf and Ur Rahman 2017). At the same time, these methods require substantial technical knowledge and do not account for English words or Arabic-based Islamic expressions (e.g. ما شاء الله) and their variants (e.g. mashAllah, ma sha’ Allah, mash’Allah, mA, etc.). This paper advocates the use of spreadsheet applications as an accessible and adaptable tool for regularizing variability in language, script, and orthographic practices in Urdu-based social media discourse. Drawing from challenges faced in our respective research projects, we focus on a small set of piously affective terms and phrases that highlight the applicability of this work for DH projects in Muslim digital worlds. The paper argues that shortening the technical learning curve improves the robustness of DH work with RTL languages, particularly in social media spaces. We elaborate how regularizing orthographic variability in the digital culture in Islamic South Asia and its diasporas widens the analytical scope for scholars working with multiscript, polylingual, and religiously-inflected datasets.","accessed":{"date-parts":[[2021,6,4]]},"author":[{"family":"Dugan","given":"Max"},{"family":"Montpellier","given":"Elliot"}],"citation-key":"DuganMontpellier2021MultipleScripts","event-place":"Online","event-title":"DHSI 2021: Right to Left","issued":{"date-parts":[[2021,6,8]]},"language":"en","publisher-place":"Online","title":"Multiple Scripts: Regularizing Social Media Discourse in Urdu and its (Many) Transliterations","type":"speech","URL":"https://dhsi.org/dhsi-2021-online-edition/dhsi-2021-online-edition-aligned-conferences-and-events/dhsi-2021-right-to-left/full-access/"},
  {"id":"EAP119/1/18_website","abstract":"The series contains digital images of 179 issues of the Turkish newspaper Tasvir-i efkar, covering the period May 1909 - November 1909. Tas…","accessed":{"date-parts":[[2023,1,24]]},"author":[{"literal":"British Library"}],"citation-key":"EAP119/1/18_website","container-title":"Endangered Archives Programme","language":"en","title":"تصوير افكار Taṣwīr Afkār (1909)","type":"webpage","URL":"https://eap.bl.uk/collection/EAP119-1-18"},
  {"id":"EAP119/1/24_website","abstract":"The series contains digital images of 64 issues of the newspaper Mir'āt al-Sharq, dating from November 1922 - April 1936. Mir'āt al-Sharq ('Mirror of the East') was established in Jerusalem in 1919 by Bulus Shihada. A supporter of the opposition (mu'aridin), it was shut down by the British authorities in 1938. Originally published on paper, measuring variously 31 x 35 cm, 56 x 40 cm, and 36 x 48 cm","accessed":{"date-parts":[[2023,1,24]]},"author":[{"literal":"British Library"}],"citation-key":"EAP119/1/24_website","container-title":"Endangered Archives Programme","language":"en","title":"مرأة الشرق Mirʾat al-Sharq (1922-1936)","type":"webpage","URL":"https://eap.bl.uk/collection/EAP119-1-24"},
  {"id":"FarziKianian2019KatibehPersianNews","abstract":"Nowadays, text summarization is one of the most important active research fields in information retrieval. The most of the supervised extractive summarization systems utilize learning-to-rank methods to score sentences according to their importance. They need a high-quality comprehensive summarization corpus, which is labeled manually by human experts. Unfortunately, this sort of corpus is not available for most low-resource languages such as Persian. In this study, first of all, a comprehensive human-labeled summarization corpus (called Bistoon) collected by the crowdsourcing approach is introduced, and then a Persian summarizer based on a novel semi-supervised summarization approach, which is a combination of co-training and self-training, is presented to overcome the absence of sufficient data. During an iterative process, the proposed system is learned by Bistoon corpus and applied to unlabeled texts to generate the most confident summaries. These summaries are added to Bistoon for more iterations. During iterations, the training corpus is grown and the quality of the summarizer is simultaneously improved. The proposed system has been compared to other well-known Persian summarizers over the Pasokh and Bistoon standard test data sets. The evaluation results show the superiority of our methods in terms of precision, F-measure, Rouge metrics, and also human judgments.","accessed":{"date-parts":[[2023,1,26]]},"author":[{"family":"Farzi","given":"Saeed"},{"family":"Kianian","given":"Sahar"}],"citation-key":"FarziKianian2019KatibehPersianNews","container-title":"Digital Scholarship in the Humanities","container-title-short":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqy034","ISSN":"2055-7671","issue":"2","issued":{"date-parts":[[2019,6,1]]},"page":"277-289","source":"Silverchair","title":"Katibeh: A Persian news summarizer using the novel semi-supervised approach","title-short":"Katibeh","type":"article-journal","URL":"https://doi.org/10.1093/llc/fqy034","volume":"34"},
  {"id":"Fiormonte2021Taxation","abstract":"In Silencing the Past: Power and the Production of History, Michel-Rolph Trouillot writes that by examining the process of history we can “discover the differential exercise of power that makes some narratives possible and silences others.” Alternative Historiographies of the Digital Humanities examines the process of history in the narrative of the digital humanities and deconstructs its history as a straight line from the beginnings of humanities computing. By discussing alternatives histories of the digital humanities that address queer gaming, feminist game studies praxis, Cold War military-industrial complex computation, the creation of the environmental humanities, monolingual discontent in DH, the hidden history of DH in English studies, radical media praxis, cultural studies and DH, indigenous futurities, Pacific Rim postcolonial DH, the issue of scale and DH, the radical, indigenous, feminist histories of the digital database, and the possibilities for an antifascist DH, this collection hopes to re-set discussions of the straight, white origin myths of DH. Thus, this collection hopes to reexamine the silences in such a straight and white masculinist history and delineates how power comes into play to shape this straight, white DH narrative.  A number of the pieces in this volume go back to the origin myth of the digital humanities to reassess the hagiography of Father Busa by reconsidering and recontextualizing his legacy and his work in relation to media archaeology, politics, Cold War maneuvers, mechanized genocide, the Third Reich, and the military-industrial complex as it has organized various fields, including Asian Studies. This reassessment of comparative genealogies — vis-à-vis Foucault — undergirds an alternative history of the Jesuit hagiography we have so far been unwilling to reexamine for its narrative use in embellishing an origin hagiography/historiography for digital humanities. Other pieces intertwine the digital humanities with other fields — area studies, Asian American Studies, cultural studies, literary studies, and environmental studies — in order to reexamine how the intersections and juxtapositions reveal silences in these histories. And finally, a number of pieces considers alternative praxes in rethinking these histories, whether it is an essay that is a game or a reevaluation of feminist media praxis.","accessed":{"date-parts":[[2021,6,25]]},"author":[{"family":"Fiormonte","given":"Domenico"}],"citation-key":"Fiormonte2021Taxation","container-title":"Alternative Historiographies of the Digital Humanities","DOI":"10.53288/0274.1.00","editor":[{"family":"Kim","given":"Dorothy"},{"family":"Koh","given":"Adeline"}],"event-place":"Earth","ISBN":"978-1-953035-58-5","issued":{"date-parts":[[2021,6,24]]},"language":"en","license":"CC BY-SA-NC 4.0","page":"333-376","publisher":"punctum books","publisher-place":"Earth","title":"Taxation against Overrepresentation? The Consequences of Monolingualism for Digital Humanities","title-short":"Taxation against Overrepresentation?","type":"chapter","URL":"https://punctumbooks.com/titles/alternative-histories-of-the-digital-humanities/"},
  {"id":"FiormonteEtAl2015PoliticsOfCode","abstract":"1. Introduction Digital languages and instruments are not only powerful tools for simplifying and enhancing the work of humanists and social scientists, they also create new cultural representations and self-representations that transform both the epistemology and the practice of research.\nIn particular, digital representations can influence and shape our cultural artefacts and everyday experiences in various ways. For example, we are influenced in the way we represent everyday digital objects, such as the Windows folder as a metaphor for &lsquo;document box&rsquo;. This is at the level of the interfaces that &lsquo;produce users through benign interactions [&hellip;]. That is, as ideology create subjects, interactive and seemingly real-time interfaces create users who believe they are the &ldquo;source&rdquo; of the computer&rsquo;s action&rsquo; (Chun 2011: 66-68). We are also influenced by the ways in which we write software or encode a document through specific languages (e.g. &nbsp;Python or HTML). However, it is easy to demonstrate that such a distinction is artificial (and often damaging). From a semiotic point of view, both representations (visible interface and invisible coding) are &lsquo;modelling systems&rsquo; (Uspenskij et al. 1973) that cast their influence on overlapping political, social, cognitive and epistemological domains. In the first case we are talking about an influence mainly on practices and processes (social and cognitive dimensions), and in the second case we are dealing with the theory and interpretation of information structures (linguistic, hermeneutical and epistemological dimensions).\nIn our paper we will focus on this second aspect, and show some examples of how code and encodings are shaping the way we conceive and practise the work of reconstruction, conservation and representation of information structures and cultural artefacts. To this aim, we will discuss three encoding tools widely used in the Humanities and Social Sciences communities: HTML, the de facto standard for encoding World Wide Web documents and pages, Unicode, an industry standard designed to allow text and symbols from all of the writing systems of the world to be consistently represented and manipulated by computers, and XML (eXtensible Markup Language), which defines a set of rules for encoding documents.\n2. HTML War\nThe evolution of HTML (Hypertext Markup Language) as a structural language and application standard of the World Wide Web has been largely shaped by forces outside of the World Wide Web Consortium (W3C), the international community assembled by Tim Berners-Lee &lsquo;to lead the World Wide Web to its full potential by developing protocols and guidelines that ensure the long-term growth of the Web.&rsquo; (http://www.w3.org/Consortium/)\nEven before it became a W3C Recommendation on October 28, 2014, HTML5 had already reached in 2009 the status of a de facto standard on the Web. This was promoted and encouraged by the Web Hypertext Application Technology Working Group (WHATWG), a community established by Apple, the Mozilla Foundation and Opera Software (joined later by Google) that was in open opposition to the development of the language of the Web as envisioned by the W3C and &lsquo;concerned about the W3C&rsquo;s direction with XHTML, lack of interest in HTML and apparent disregard for the needs of real-world authors.&rsquo; (https://wiki.whatwg.org/wiki/FAQ#What_is_the_WHATWG.3F)\nAs in the days of the browser wars between Netscape Navigator and Microsoft Internet Explorer (Sordi 2010), tensions collide (and versions are released) around the code of the World Wide Web that appear to be inspired by benefits for the authors and the users of the Web, but in in fact were tied to strategies to control a market that Web 2.0 apps, social media and the eternal promise of the Semantic Web have once again enhanced (Zeldman - Marcotte 2010).\nControlling the development of HTML means controlling the competition between the different software used to access the Web (Ford 2014); managing the scheduling and release of mobile applications that can now compete at the same level as desktop applications, without being forced to adopt or implement competing solutions; and to determine how texts and information on the Web can be searched and placed interrelated, making the definitive migration from a Web based on document search to a system for collecting user data. In other words, behind the HTML war there is a growing obsession by industry and governments with our digital traces, habits and personal information (Lyon &ndash; Bauman 2013; Bowker 2013).\n3. The cultural and political biases of XML\nA markup language permits us to formally describe the structure of a text, and to analyse the data in depth. Its utility will be in proportion to how much information it can set out, include and preserve. The word &lsquo;markup&rsquo; itself shows its original bias: ironically, like other computing languages, XML is one the most faithful successors to the Gutenberg model; its basic aim is to imitate and preserve structured information as laid out in modern printed books. But is hierarchical and structured information an inherent and universal feature of texts (let alone writing)? The bias inherited from print has forced us to think of a text as a stable product, but if we either look at the different historical representations of a given text or at its documented writing stages, it is clear that there is not one text, but as many different texts as there are mechanisms of writing, material production, intertextual paths and methodologies of reconstruction (Fiormonte &ndash; Schmidt &ndash; Martiradonna 2010). Not only there is a potential conflict between the linear and hierarchical nature of current markup languages, and the intrinsic dynamic nature of the writing process, current text encoding tools and methodologies seems to constitute the most serious obstacle to the development of an independent theory of digital text.\nA typical example of the overlapping between geopolitical settings and technical choices can be found in organisations like the TEI (Text Encoding Initiative), an international consortium that defines guidelines for encoding cultural heritage documents in XML. However, the practice of defining encoding standards to allow electronic documents to be processed ultimately by shared software at the presentation level, does not work nearly as well for the encoding of historical primary sources (Schmidt 2014). Attempts to declare &lsquo;standard&rsquo; names for textual features overlook significant variations in the interpretation, selection and application of those codes by different groups, individuals and cultures. Once again, the &lsquo;practice&rsquo; of code is the result of the &lsquo;theory&rsquo; reflected by certain groups and interests. Encoding tools and methodologies become examples of &lsquo;symbolic capital&rsquo; (Bourdieu 1984) used by the TEI community to &nbsp;export a universalising, western-centric approach to the representation of cultural artefacts.\n4. Universalizing the typography: Unicode &nbsp;\nThe Unicode standard aims at constituting a universal and inclusive mapping of all graphemes from existing and past writing systems. Yet, some assumptions that underlie the standard are shaped by the culture-specific standardisation of the graphical representation of language generated by Gutenberg&rsquo;s invention of moveable type printing.\nThe Unicode writing system, now forced upon all scripts, is based on a discrete ordered sequence of individual characters flowing only in one direction and dimension. However, in many writing systems based on handwriting, including contemporary Arabic and some Indic scripts, some graphemes &lsquo;orbit&rsquo; around a central grapheme and can be written not only after (left or right, depending on the main direction of the script), but also before, above or under the &lsquo;main&rsquo; grapheme. This is the case of ancient Greek &lsquo;hypogegrammenon (subscribed) iota&rsquo;, written before another vowel if lowercase, but after that vowel if uppercase. A wider case study is provided by the right-to-left Indic scripts where some vowels, although pronounced after a consonant, may be written before it (The Unicode Consortium 2014, chapter 12.1; Perri 2009; Constable 2001, II, par. 6.3).\nAnother assumption underlying the Unicode model is a one-to-one correspondence between phoneme and grapheme. The European medieval handwriting conventions based on the Greek or Latin alphabets are an interesting case study in this respect: ligatures, brevigraphs (sometimes represented by apparent diacritics such as macrons) and logographs are systematic and &lsquo;regular&rsquo; here, and the underlying model is incompatible with the Unicode/Gutenberg one-to-one correspondence between a phoneme and a character in a linear sequence. However, the XML/TEI Guidelines for the transcription of pre-modern primary sources simply recommend the use of Unicode for this purpose (TEI P5 Guidelines, chapter 5).\nIn all these cases, the current version of Unicode imposes the Gutenberg model (based on the Latin alphabet used in Europe in the Modern Age) upon writing systems based on different models, and all discrepancies are treated as &lsquo;exceptions&rsquo; to be dealt with at the presentational rendering level through software workarounds.\n5. Conclusions\nThese case studies show that digital &lsquo;standards&rsquo; always reflect a cultural bias (Carey 2009), and that the level of encoding is never neutral, but tends to assume (and overlap with) universalising discourses that are usually invisible at the surface of technology (Galloway 2012).\nDigital Universalism (Chan 2014) is deeply intertwined with the question of language, which in its turn controls our encoding practices. Code imperialism and linguistic imperialism (Phillipson 2009) are two sides of the same coin. We are facing a codex universalis, based on the English lingua franca, used to articulate and exert a power of &nbsp;standardisation and control.\nBut codes and encoding(s) before or along &lsquo;semiotic&rsquo;, &lsquo;hermeneutic&rsquo; or &lsquo;cultural&rsquo; are also political phenomena. &nbsp;Looking at boards, offices and steering committees reveals that consortia, associations and organisations like Unicode, ICANN , TEI or the W3C are informed by Anglophone hegemonies, and their decisions are shaped by their commercial interests, ideologies and cultures. So apparently &lsquo;neutral&rsquo;, &lsquo;technical&rsquo; decisions, as can be observed in Unicode, TEI or other organisations, tend to oversimplify and standardise the complex diversity of languages and cultural artefacts.\nAs Friedrich Kittler put it: &lsquo;Codes&mdash;by name and by matter&mdash;are what determine us today, and what we must articulate if only to avoid disappearing under them completely. &hellip; Today, technology puts code into the practice of realities, that is to say: it encodes the world&rsquo; (Kittler 2008: 40). &nbsp;So, is it still in our power to code (encode reality), or rather is code imposing on us its biases and constraints?\nIn the conclusion of our presentation we will try to propose solutions to avoid or reduce the impact of universalistic encoding, and report on alternative experiences and experiments that try to resist the effects of &lsquo;colonial computing&rsquo; (Ali 2014).References\nAli, Mustafa (2014). &ldquo;Towards a decolonial computing&rdquo;, CEPE 2013: Computer Ethics: Philosophical Enquiry, 1-3 July 2013, Lisbon, Portugal, International Society of Ethics and Information Technology, pp. 28&ndash;35.\nBauman, Zygmunt and Lyon, David (2013). Liquid Surveillance. A Conversation. Cambridge: Polity Press.\nBourdieu, Pierre (1984). Distinction: A social critique of the judgement of taste. Cambridge, MA: Harvard University Press.\nBowker, Geoffrey Y. (2013). &ldquo;Data Flakes: an afterword to &lsquo;Raw Data&rsquo; is an oxymoron&rdquo;. In Gitelman, Lisa (ed.) &lsquo;Raw Data&rsquo; is an oxymoron. &nbsp;Cambridge (MA): MIT Press, pp. 167-171.\nCarey, James W. (2009). Communication as Culture. Essays on Media and Society, Revised Edition. New York and Abingdon: Routledge.\nChan, Anita S. (2014). Networking Peripheries: Technological Futures and the Myth of Digital Universalism. Cambridge (MA): MIT Press.\nConstable, Peter G. (2001). Understanding Unicode: a general introduction to the Unicode Standard. NRSI: Computers &amp; Writing, 2001 (http://scripts.sil.org/cms/scripts/page.php?item_id=IWS-Chapter04b).\nFiormonte, Domenico, Martiradonna, Valentina, Schmidt, Desmond (2010). &ldquo;Digital Encoding as a Hermeneutic and Semiotic Act: The Case of Valerio Magrelli&rdquo;, Digital Humanities Quarterly, Vol. 4, N. 1 (http://digitalhumanities.org/dhq/vol/4/1/000082/000082.html).\nFord, Paul (2014). &ldquo;On HTML5 and the Group That Rules the Web&rdquo;, The New Yorker, November 20, 2014, (http://www.newyorker.com/tech/elements/group-rules-web).\nGalloway, Alexander R. (2012). The interface effect. London: Polity Press.\nKittler, Friedrich (2008). &ldquo;Code (or, How You Can Write Something Differently)&rdquo;, in&nbsp;Matthew  Fuller, Software Studies: A Lexicon. Cambridge (MA): MIT Press, pp. 40-47.\nPerri, Antonio (2009). &ldquo;Al di l&agrave; della tecnologia, la scrittura. Il caso Unicode&rdquo;, Annali dell&rsquo;Universit&agrave; degli Studi Suor Orsola Benincasa, Vol. II, pp. 725-748.\nPhillipson, Robert (2009). Linguistic imperialism continued. New York and London: Routledge.\nSchmidt, Desmond (2014). &nbsp;&ldquo;Towards an Interoperable Digital Scholarly Edition&rdquo;, Journal of the Text Encoding Initiative [Online], Issue 7 (http://jtei.revues.org/979).\nSordi, Paolo (2010). &ldquo;Leggere il codice del Web&rdquo;, Testo e Senso, 11, 2010 (http://testoesenso.it/article/view/1).\nTEI Consortium, eds. (2007). TEI P5: Guidelines for Electronic Text Encoding and Interchange, TEI Consortium (http://www.tei-c.org/Guidelines/P5/, last retrieved: February 27, 2015).\nThe Unicode Consortium (2014). The Unicode Standard, Version 7.0.0. Mountain View (CA): The Unicode Consortium.Uspenskij, Boris Andreevich; Ivanov, Vyacheslav Vsevolodovich; Piatigorskij, Alexander; Lotman, Juri M. (1973). &ldquo;Tezisy k semiotičeskomu izučeniju kul&rsquo;tur (v primenenii k slavjanskim tektstam)&rdquo;, in M. R. Mayenowa (ed.), Semiotyka i Struktura Tekstu. Studia święcone VII międz. Kongresowi Slawist&oacute;w, Warszawa, pp. 9-32. Trad. en. &ldquo;Theses on the Semiotic Studies of Culture (As applied to Slavic Texts)&rdquo;, in Jan van der Eng and Mojmír Grygar (eds.), Structure of texts and semiotics of culture, The Hague: Mouton, 1973, pp. 1-28.\nZeldman, Jeffrey and Marcotte, Ethan &nbsp;(2010). Designing with Web Standards (3rd edition). Berkeley, New Riders.\nWHATWG (https://whatwg.org).\nW3C (http://www.w3.org).","accessed":{"date-parts":[[2021,6,29]]},"author":[{"family":"Fiormonte","given":"Domenico"},{"family":"Schmidt","given":"Desmond"},{"family":"Monella","given":"Paolo"},{"family":"Sordi","given":"Paolo"}],"citation-key":"FiormonteEtAl2015PoliticsOfCode","container-title":"ISIS Summit Vienna 2015—The Information Society at the Crossroads","DOI":"10/gkzc7v","event-place":"Vienna","issued":{"date-parts":[[2015,6,19]]},"language":"en","license":"http://creativecommons.org/licenses/by/3.0/","publisher":"MDPI AG","publisher-place":"Vienna","source":"sciforum.net","title":"The Politics of code. How digital representations and languages shape culture","type":"paper-conference","URL":"10/gkzc7v"},
  {"id":"Grallert2021GG","abstract":"The essay explores the use of digital history for the systematic study of the periodical press in the late Ottoman Eastern Mediterranean (1906 –1918) as a discursive field. It evaluates the methodological and practical challenges of digital history as rooted in the socio-technical infrastructures of the Global North when applied to the Global South. It does so using a case study of four Arabic journals from Baghdad, Beirut, Cairo, and Damascus. After outlining the need for building a corpus and the challenges presented by this effort, this article explores a digital corpus of a total of circa 2.65 million words through (social) network analysis and stylometric authorship attribution.","accessed":{"date-parts":[[2021,6,11]]},"author":[{"family":"Grallert","given":"Till"}],"citation-key":"Grallert2021GG","container-title":"Geschichte und Gesellschaft","container-title-short":"GuG","DOI":"10/gkhrjr","editor":[{"family":"Lässig","given":"Simone"}],"issue":"1, Digital History","issued":{"date-parts":[[2021,6,10]]},"language":"en","license":"CC BY-NC-ND 4.0","note":"BibTeX Key: Grallert+2020","page":"58 - 89","title":"Catch Me If You Can! Approaching the Arabic Press of the Late Ottoman Eastern Mediterranean through Digital History","title-short":"Catch me if you can!","type":"article-journal","volume":"47"},
  {"id":"Grallert2022DHQ","abstract":"This paper introduces and evaluates the project Open Arabic Periodical Editions (OpenArabicPE) as a case study of minimal computing. It confronts hyperbolic promises of mass digitization and computational methods for the exploration of digitized cultural heritage as a hegemonic episteme rooted in 20th-century, English-speaking, neoliberal capitalism from the margins. OpenArabicPE is a framework for open, collaborative, and scholarly digital editions of early Arabic periodicals from the late Ottoman Eastern Mediterranean. It addresses the specific affordances of a historical multilingual society, whose material heritage continues to be looted, destroyed, and neglected; whose material heritage resists digitization efforts by being dependent on non-Latin scripts and, for instance, non-Gregorian calendars; and whose contemporary heirs cannot draw on the vast resources in wealth and socio-technical infrastructures of the Global North. Centered around generosity and minimal computing, OpenArabicPE is run by volunteers and currently hosts six editions with some 630 journal issues and more than 7 million words, without any funding, by re-purposing data, software, and infrastructures.","archive":"https://web.archive.org/web/20230302132915/http://digitalhumanities.org/dhq/vol/16/2/000593/000593.html","author":[{"family":"Grallert","given":"Till"}],"citation-key":"Grallert2022DHQ","container-title":"Digital Humanities Quarterly","container-title-short":"DHQ","editor":[{"family":"Risam","given":"Roopika"},{"family":"Gil","given":"Alex"}],"issue":"2,  \"Minimal Computing\"","issued":{"date-parts":[[2022,6,28]]},"language":"en","license":"CC BY-ND 4.0","title":"Open Arabic Periodical Editions: A framework for bootstrapped scholarly editions outside the global north","type":"article-journal","URL":"http://digitalhumanities.org/dhq/vol/16/2/000593/000593.html","volume":"16"},
  {"id":"Grallert2022IntegratingLibraryData","abstract":"A recent Twitter post from my former colleague Anne Klammt made me aware of a recent relaunch of “Zeitschriftendatenbank” (ZDB), the portal for periodical holdings in German (and Austrian) libraries. Just played around with the German Union Catalogue of Serails (ZDB) @DNB_Aktuelles Nice graphs, maps and data. #journals #linkeddata … „Integrating library data into an authority file: The challenges of MARC XML and inconsistent transcription practices“ weiterlesen","accessed":{"date-parts":[[2022,3,31]]},"author":[{"family":"Grallert","given":"Till"}],"citation-key":"Grallert2022IntegratingLibraryData","container-title":"Digital Humanities Lab","issued":{"date-parts":[[2022,2,18]]},"language":"en","license":"All rights reserved","title":"Integrating library data into an authority file: The challenges of MARC XML and inconsistent transcription practices","title-short":"Integrating library data into an authority file","type":"post-weblog","URL":"https://dhlab.hypotheses.org/2631"},
  {"id":"GruendlerArabicScript","accessed":{"date-parts":[[2023,1,24]]},"author":[{"family":"Gruendler","given":"Beatrice"}],"citation-key":"GruendlerArabicScript","container-title":"Encyclopaedia of the Qurʾān","DOI":"10.1163/1875-3922_q3_EQCOM_00016","editor":[{"family":"Pink","given":"Johanna"}],"event-place":"Leiden","language":"en","publisher":"Brill","publisher-place":"Leiden","title":"Arabic Script","type":"entry-encyclopedia","URL":"http://dx.doi.org/10.1163/1875-3922_q3_EQCOM_00016"},
  {"id":"GundelfingerVerkinderen2020Governors","abstract":"The Governors of al-Shām and Fārs in the Early Islamic Empire – A Comparative Regional Perspective was published in Volume 1 Transregional and Regional Elites – Connecting the Early Islamic Empire on page 255.","accessed":{"date-parts":[[2023,1,31]]},"author":[{"family":"Gundelfinger","given":"Simon"},{"family":"Verkinderen","given":"Peter"}],"citation-key":"GundelfingerVerkinderen2020Governors","container-title":"The Governors of al-Shām and Fārs in the Early Islamic Empire – A Comparative Regional Perspective","DOI":"10.1515/9783110669800-010","ISBN":"978-3-11-066980-0","issued":{"date-parts":[[2020,2,10]]},"language":"en","page":"255-330","publisher":"De Gruyter","source":"www.degruyter.com","title":"The Governors of al-Shām and Fārs in the Early Islamic Empire – A Comparative Regional Perspective","type":"chapter","URL":"https://www.degruyter.com/document/doi/10.1515/9783110669800-010/html"},
  {"id":"HessischeRegionalzeitungen2019","accessed":{"date-parts":[[2023,1,20]]},"citation-key":"HessischeRegionalzeitungen2019","event-place":"Frankfurt am Main","issued":{"date-parts":[[2019]]},"language":"de","publisher":"HeBIS-Verbundzentrale","publisher-place":"Frankfurt am Main","title":"1914-1918: Der Erste Weltkrieg im Spiegel hessischer Regionalzeitungen","type":"webpage","URL":"https://hwk1.hebis.de/"},
  {"id":"ICUDocumentationBiDi","abstract":"ICU is a mature, widely used set of C/C++ and Java libraries providing Unicode and Globalization support for software applications. The ICU User Guide provides documentation on how to use ICU.","accessed":{"date-parts":[[2023,2,9]]},"citation-key":"ICUDocumentationBiDi","container-title":"ICU Documentation","issued":{"date-parts":[[2021,2,2]]},"language":"en-US","title":"BiDi Algorithm","type":"webpage","URL":"https://unicode-org.github.io/icu/userguide/transforms/bidi.html"},
  {"id":"Jeater2014Data","author":[{"family":"Jeater","given":"Diana"}],"citation-key":"Jeater2014Data","container-title":"African studies in the digital age","DOI":"10.1163/9789004279148","editor":[{"family":"Barringer","given":"Terry"},{"family":"Wallace","given":"Marion"}],"event-place":"Leiden","ISBN":"978-90-04-27230-9","issued":{"date-parts":[[2014,7]]},"language":"en","publisher":"Brill","publisher-place":"Leiden","title":"Data, Data Everywhere, But Not a Byte to Think: The Pitfalls of Increased Access to Digital Resources in University History Departments in Zimbabwe","type":"chapter"},
  {"id":"KahnTanner2014BuildingFutures","abstract":"The first half of this papers provides a general introduction to the idea of archives as socially produced memories that form / serve (national) identies. The second half, presents three case studies from\n\n- South Africa: ethnographic material on native prisoners\n- Uganda: ethnographic sound recordings\n- Zambia: colonial files, sold on CD\n\nVery odd and positive conclusion given that the case studies all comprised material recorded by the coloniser, which remains partially within the physical collections of the colonial centres","author":[{"family":"Kahn","given":"Rebecca Josina"},{"family":"Tanner","given":"Simon George"}],"citation-key":"KahnTanner2014BuildingFutures","container-title":"African studies in the digital age","DOI":"10.1163/9789004279148_007","editor":[{"family":"Barringer","given":"Terry"},{"family":"Wallace","given":"Marion"}],"event-place":"Leiden","ISBN":"978-90-04-27230-9","issued":{"date-parts":[[2014,7]]},"language":"en","note":"date_read: 2023-03-28","page":"109–127","publisher":"Brill","publisher-place":"Leiden","title":"Building futures: The role of digital collections in shaping national identity in africa","type":"chapter"},
  {"id":"Kirmizialtin.Wrisley+2020+AutomatedTranscriptionNonLatin","abstract":"Our study utilizes deep learning methods for the automated transcription of late nineteenth- and early twentieth-century periodicals written in Arabic script Ottoman Turkish (OT) using the Transkribus platform. We discuss the historical situation of OT text collections and how they were excluded for the most part from the late twentieth century corpora digitization that took place in many Latin script languages. This exclusion has two basic reasons: the technical challenges of OCR for Arabic script languages, and the rapid abandonment of that very script in the Turkish historical context. In the specific case of OT, opening periodical collections to digital tools require training HTR models to generate transcriptions in the Latin writing system of contemporary readers of Turkish, and not, as some may expect, in right-to-left Arabic script text. In the paper we discuss the challenges of training such models where one-to-one correspondence between the writing systems do not exist, and we report results based on our HTR experiments with two OT periodicals from the early twentieth century. Finally, we reflect on potential domain bias of HTR models in historical languages exhibiting spatio-temporal variance as well as the significance of working between writing systems for language communities that have experienced language reform and script change.","accessed":{"date-parts":[[2020,11,17]]},"author":[{"family":"Kirmizialtin","given":"Suphan"},{"family":"Wrisley","given":"David"}],"citation-key":"Kirmizialtin.Wrisley+2020+AutomatedTranscriptionNonLatin","container-title":"arXiv:2011.01139 [cs]","issued":{"date-parts":[[2020,11,2]]},"source":"arXiv.org","title":"Automated Transcription of Non-Latin Script Periodicals: A Case Study in the Ottoman Turkish Print Archive","title-short":"Automated Transcription of Non-Latin Script Periodicals","type":"article-journal","URL":"http://arxiv.org/abs/2011.01139"},
  {"id":"KirmizialtinWrisley2022AutomatedTranscription","abstract":"Our study utilizes deep learning methods for the automated transcription of late nineteenth- and early twentieth-century periodicals written in Arabic script Ottoman Turkish (OT) using the Transkribus platform. We discuss the historical situation of OT text collections and how they were excluded for the most part from the late twentieth century corpora digitization that took place in many Latin script languages. This exclusion has two basic reasons: the technical challenges of OCR for Arabic script languages, and the rapid abandonment of that very script in the Turkish historical context. In the specific case of OT, opening periodical collections to digital tools require training HTR models to generate transcriptions in the Latin writing system of contemporary readers of Turkish, and not, as some may expect, in right-to-left Arabic script text. In the paper we discuss the challenges of training such models where one-to-one correspondence between the writing systems do not exist, and we report results based on our HTR experiments with two OT periodicals from the early twentieth century. Finally, we reflect on potential domain bias of HTR models in historical languages exhibiting spatio-temporal variance as well as the significance of working between writing systems for language communities that have experienced language reform and script change.","accessed":{"date-parts":[[2020,11,17]]},"author":[{"family":"Kirmizialtin","given":"Suphan"},{"family":"Wrisley","given":"David"}],"citation-key":"KirmizialtinWrisley2022AutomatedTranscription","container-title":"Digital Humanities Quarterly","issue":"2","issued":{"date-parts":[[2022]]},"language":"en","source":"arXiv.org","title":"Automated Transcription of Non-Latin Script Periodicals: A Case Study in the Ottoman Turkish Print Archive","title-short":"Automated Transcription","type":"article-journal","URL":"http://www.digitalhumanities.org/dhq/vol/16/2/000577/000577.html","volume":"16"},
  {"id":"KizhnerEtAl2021DigitalCulturalColonialism","abstract":"In February 2011, Google launched its Google Art Project, now known as Google Arts and Culture (GA&amp;C), that currently hosts approximately six million high-resolution images of artworks from around the world, with an objective to make culture more accessible. We demonstrate that GA&amp;C has experienced dramatic growth in recent years and includes artworks for almost every country from the UN member list. However, we document a noticeable lack of balance in the aggregator, with some countries and institutions being prioritized, and a major proportion of the holdings featuring content that resides in the USA. Moreover, after examining Russian and French collections, we see the dominance of artworks from their capital cities in GA&amp;C, while art from provinces is clearly underrepresented. Finally, we find a dominance of art from the 20th century with some emphasis on artworks demonstrating a break in canon or ‘otherness’ of non-Western countries. The discrepancies that we observe give evidence to support previously posited ideas of digital cultural colonialism. This may be due to a lack of data transparency or availability of previously digitized content in the countries with a lower representation in the portal, or an unintentional digital amplification of conventional traditions of art collection and interpretation that dominate museum displays in larger Western cities. We call for explicit statement by platforms on their collection and selection criteria and the need for researchers to understand the biases emerging from aggregated digitized content.","accessed":{"date-parts":[[2023,2,13]]},"author":[{"family":"Kizhner","given":"Inna"},{"family":"Terras","given":"Melissa"},{"family":"Rumyantsev","given":"Maxim"},{"family":"Khokhlova","given":"Valentina"},{"family":"Demeshkova","given":"Elisaveta"},{"family":"Rudov","given":"Ivan"},{"family":"Afanasieva","given":"Julia"}],"citation-key":"KizhnerEtAl2021DigitalCulturalColonialism","container-title":"Digital Scholarship in the Humanities","container-title-short":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqaa055","ISSN":"2055-7671","issue":"3","issued":{"date-parts":[[2021,9,1]]},"page":"607-640","source":"Silverchair","title":"Digital cultural colonialism: measuring bias in aggregated digitized content held in Google Arts and Culture","title-short":"Digital cultural colonialism","type":"article-journal","URL":"https://doi.org/10.1093/llc/fqaa055","volume":"36"},
  {"id":"Kokoschka2020ScriptDoesNot","accessed":{"date-parts":[[2022,9,13]]},"author":[{"family":"Kokoschka","given":"Alina"}],"citation-key":"Kokoschka2020ScriptDoesNot","container-title":"Cyber Orient","issue":"2","issued":{"date-parts":[[2020]]},"note":"date_read: 2022-10-11","page":"38-63","title":"“The Script Does Not Respond” – Arabic Script’s Difficulties in the Digital Realm. A Visual Approach","type":"article-journal","URL":"https://cyberorient.net/2020/12/15/the-script-does-not-respond-arabic-scripts-difficulties-in-the-digital-realm-a-visual-approach/","volume":"14"},
  {"id":"LebaneseNationalLibrary","accessed":{"date-parts":[[2023,2,11]]},"citation-key":"LebaneseNationalLibrary","issued":{"date-parts":[[2015,6,2]]},"language":"ar","title":"The Lebanese National Library","type":"webpage","URL":"https://web.archive.org/web/20230130001213/http://bnl.gov.lb/arabic/index.html"},
  {"id":"Madhany2004ArabicWindowsArabicizing","abstract":"This paper is technical in nature. It provides detailed instructions for enabling Arabic reading and writing capabilities in most Microsoft Windows versions, the major word-processing applications, and the major Internet web browsers. This paper also discusses useful, time-tested hints and resources for using Arabic with Windows including enabling the Arabic Proofing Tools, enabling the On Screen Arabic Keyboard, typing right-to-left, typing Hindi numerals, defining Arabic romanization keyboards, and finding Arabic fonts, English/Arabic keyboards, Arabic QWERTY keyboards, and Arabic keytop labels. This paper has been adapted from a manuscript the author is currently writing on resources for Arabic language study in America and on the Internet.","accessed":{"date-parts":[[2023,1,25]]},"author":[{"family":"Madhany","given":"al-Husein N."}],"citation-key":"Madhany2004ArabicWindowsArabicizing","container-title":"Review of Middle East Studies","DOI":"10.1017/S0026318400046423","ISSN":"0026-3184, 2329-3233","issue":"1","issued":{"date-parts":[[2004,6]]},"language":"en","page":"44-54","publisher":"Cambridge University Press","source":"Cambridge University Press","title":"Arabic Windows: Arabicizing Windows Applications to Read and Write Arabic","title-short":"Arabic Windows","type":"article-journal","URL":"https://www.cambridge.org/core/journals/review-of-middle-east-studies/article/abs/arabic-windows-arabicizing-windows-applications-to-read-and-write-arabic/3E5F12A03551EF5240B305923C0149D9","volume":"38"},
  {"id":"Matar2018UnitedStatesArab","accessed":{"date-parts":[[2023,1,13]]},"author":[{"family":"Matar","given":"Nabil"}],"citation-key":"Matar2018UnitedStatesArab","event-place":"Edinburgh","issued":{"date-parts":[[2018]]},"language":"en","publisher":"Edinburgh University Press","publisher-place":"Edinburgh","title":"The United States Through Arab Eyes: An Anthology of Writings (1876-1914)","type":"book","URL":"https://www.worldcat.org/title/1312698890"},
  {"id":"Mestyan.Grallert+2012+ProjectJaraid","accessed":{"date-parts":[[2020,11,19]]},"author":[{"family":"Mestyan","given":"Adam"},{"family":"Grallert","given":"Till"}],"citation-key":"Mestyan.Grallert+2012+ProjectJaraid","contributor":[{"family":"Sadgrove","given":"Philip"},{"family":"Auji","given":"Hala"},{"family":"Chevrant","given":"Philippe"},{"family":"Eid","given":"Lamia"},{"family":"Issa","given":"Rana"},{"family":"Meier","given":"Christian"},{"family":"Newman","given":"Daniel"},{"family":"Roper","given":"Geoffrey"},{"family":"Seif","given":"Ola"},{"family":"Visser","given":"Rogier"}],"issued":{"date-parts":[[2012],[2015]]},"language":"en","license":"All rights reserved","title":"A Chronology of Nineteenth-Century Periodicals in Arabic (1800-1900): A research tool","type":"webpage","URL":"https://web.archive.org/web/20160422071133/https://www.zmo.de/jaraid/"},
  {"id":"Mestyan.Grallert+2020+JaraIdChronology","accessed":{"date-parts":[[2020,11,19]]},"author":[{"family":"Mestyan","given":"Adam"},{"family":"Grallert","given":"Till"}],"citation-key":"Mestyan.Grallert+2020+JaraIdChronology","contributor":[{"family":"Auji","given":"Hala"},{"family":"Chevrant","given":"Philippe"},{"family":"Demetriadou","given":"Marina"},{"family":"Eid","given":"Lamia"},{"family":"Issa","given":"Rana"},{"family":"Meier","given":"Christian"},{"family":"Newman","given":"Daniel"},{"family":"Roper","given":"Geoffrey"},{"family":"Sadgrove","given":"Philip"},{"family":"Seif","given":"Ola"},{"family":"Visser","given":"Rogier"}],"issued":{"date-parts":[[2020]]},"language":"en","license":"All rights reserved","title":"Jara'id: A Chronology of Arabic Periodicals (1800-1929). 2020 Edition","type":"webpage","URL":"https://projectjaraid.github.io/"},
  {"id":"MestyanEtAl2020JaraidDataset","abstract":"This is the first release of Project Jarāʾid's bibliographic data set for all periodicals published globally in Arabic (or Arabic plus additional languages) between 1800 and 1929. The data set is the basis for the website https://projectjaraid.github.io/. All relevant descriptive information can be found in the README and the main TEI XML file. We thank Hala Auji, Philippe Chevrant, Marina Demetriadou, Lamia Eid, Stacy Fahrenthold, Till Grallert, Rana Issa, Nicole Khayat, Peter Magierski, Leyla von Mende, Adam Mestyan, Christian Meier, Daniel Newman, Geoffrey Roper, Sinai Rusinek, Philip Sadgrove, Ola Seif, and Rogier Visser for contributing data.","accessed":{"date-parts":[[2021,1,21]]},"author":[{"family":"Mestyan","given":"Adam"},{"family":"Grallert","given":"Till"},{"literal":"et al."}],"citation-key":"MestyanEtAl2020JaraidDataset","DOI":"10.5281/zenodo.4399240","issued":{"date-parts":[[2020,12,29]]},"license":"All rights reserved","note":"BibTeX Key: Mestyan.etal+2020+JaraidAchronology","publisher":"Zenodo","source":"Zenodo","title":"Jarāʾid: A chronology of Arabic periodicals (1800-1929)","title-short":"Jarāʾid","type":"dataset","URL":"https://zenodo.org/record/4399240","version":"1.0"},
  {"id":"Milo2011ArabicTypography","accessed":{"date-parts":[[2023,1,24]]},"author":[{"family":"Milo","given":"Thomas"}],"citation-key":"Milo2011ArabicTypography","container-title":"Encyclopedia of Arabic Language and Linguistics","DOI":"10.1163/1570-6699_eall_EALL_SIM_000043","editor":[{"family":"Edzard","given":"Lutz"},{"family":"Jong","given":"Rudolf","dropping-particle":"de"}],"event-place":"Leiden","issued":{"date-parts":[[2011,5,30]]},"language":"en","publisher":"Brill","publisher-place":"Leiden","source":"referenceworks.brillonline.com","title":"Arabic Typography","type":"entry-encyclopedia","URL":"https://referenceworks.brillonline.com/entries/encyclopedia-of-arabic-language-and-linguistics/*-EALL_SIM_000043"},
  {"id":"MiloCommentsArabicBlock","author":[{"family":"Milo","given":"Thomas"}],"call-number":"L2/01-329","citation-key":"MiloCommentsArabicBlock","language":"en","publisher":"DecoType","title":"Some comments on the Arabic block in Unicode","type":"document"},
  {"id":"MiyagawaEtAl2019OpticalCharacterRecognition","abstract":"Digital Humanities (DH) within Coptic Studies, an emerging field of development, will be much aided by the digitization of large quantities of typeset Coptic texts. Until recently, the only Optical Character Recognition (OCR) analysis of printed Coptic texts had been executed by Moheb S. Mekhaiel, who used the Tesseract program to create a text model for liturgical books in the Bohairic dialect of Coptic. However, this model is not suitable for the many scholarly editions of texts in the Sahidic dialect of Coptic which use noticeably different fonts. In the current study, DH and Coptological projects based in Göttingen, Germany, collaborated to develop a new Coptic OCR pipeline suitable for use with all Coptic dialects. The objective of the study was to generate a model which can facilitate digital Coptic Studies and produce Coptic corpora from existing printed texts. First, we compared the two available OCR programs that can recognize Coptic: Tesseract and Ocropy. The results indicated that the neural network model, i.e. Ocropy, performed better at recognizing the letters with supralinear strokes that characterize the published Sahidic texts. After training Ocropy for Coptic using artificial neural networks, the team achieved an accuracy rate of &gt;91% for the OCR analysis of Coptic typeset. We subsequently compared the efficiency of Ocropy to that of manual transcribing and concluded that the use of Ocropy to extract Coptic from digital images of printed texts is highly beneficial to Coptic DH.","accessed":{"date-parts":[[2023,1,26]]},"author":[{"family":"Miyagawa","given":"So"},{"family":"Bulert","given":"Kirill"},{"family":"Büchler","given":"Marco"},{"family":"Behlmer","given":"Heike"}],"citation-key":"MiyagawaEtAl2019OpticalCharacterRecognition","container-title":"Digital Scholarship in the Humanities","container-title-short":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqz023","ISSN":"2055-7671","issue":"Supplement_1","issued":{"date-parts":[[2019,12,1]]},"page":"i135-i141","source":"Silverchair","title":"Optical character recognition of typeset Coptic text with neural networks","type":"article-journal","URL":"https://doi.org/10.1093/llc/fqz023","volume":"34"},
  {"id":"Mumin.Versteegh+2014+TheArabicScript","abstract":"The Arabic script in Africa is a collection of sixteen papers on the past and present use of Arabic script to write African languages other than Arabic, discussing the (ethno-)historical, (socio-)linguistic, and in particular grammatological aspects of such writing traditions.","author":[{"family":"Mumin","given":"Meikal"},{"family":"Versteegh","given":"Kees"}],"citation-key":"Mumin.Versteegh+2014+TheArabicScript","event-place":"Leiden","ISBN":"978-90-04-25680-4","issued":{"date-parts":[[2014,1,30]]},"language":"en","number-of-pages":"420","publisher":"Brill","publisher-place":"Leiden","source":"Google Books","title":"The Arabic Script in Africa: Studies in the Use of a Writing System","title-short":"The Arabic Script in Africa","type":"book"},
  {"id":"Nemeth+2013","abstract":"# author's abstract<br>This thesis investigates the evolution of Arabic type-making under the influence of changing technologies. Its historical scope is limited by two events which marked significant turning points in technological development: in 1908 the first adaptation of Arabic to mechanical typesetting equipment heralded the beginning of machine-aided composition; and in 1993 the wide-spread adoption of the Unicode encoding standard marked the end of equipment (platform) dependency for type. Drawing on original archival research, this study mainly analyses primary sources to establish the principal factors that influenced decision making in the design process. It thus aims to contribute to the closing of substantial gaps in existing literature, often marked by fragmentary, unsubstantiated or erroneous information. The thesis outlines the characteristics of changing manufacturing processes and composition equipment, highlighting the impact that technical constraints of machinery conceived for the Latin script had on Arabic type. Moreover, the relative importance of technological constraints and economic pressure, as well as cultural and artistic considerations, are critically assessed through select case studies, chosen for their significance and influence on type-making. The study also briefly discusses the collaboration of Western companies with their customers and representatives in the Arabic script world, and in passing it contextualises typographic,developments in the larger socio-economic settings of the region. In conclusion, historically influential trends and themes developed throughout the thesis are summarised in a concise discussion of the changing approaches to Arabic type-making. Additionally, these approaches are evaluated in order to delineate characteristics of best practice for current practitioners and students. The thesis is intended to be informative for type, printing and design historians, and scholars from a range of related disciplines.","author":[{"family":"Nemeth","given":"Titus"}],"citation-key":"Nemeth+2013","genre":"PhD Thesis","issued":{"date-parts":[[2013]]},"note":"uuid: FD30FE38-46C8-44FA-AFBB-89770AAFFD53","publisher":"University of Reading","title":"Arabic type-making in the machine age: the influence of technology on the form of Arabic type, 1908-1993","title-short":"Arabic type-making in the machine age","type":"thesis"},
  {"id":"Nemeth+2017","author":[{"family":"Nemeth","given":"Titus"}],"call-number":", 017 766","citation-key":"Nemeth+2017","DOI":"10.1163/9789004349308","event-place":"Leiden","issued":{"date-parts":[[2017]]},"language":"en","note":"uuid: B1FC9110-09EE-4B3B-97BD-BE1327393ACD\nBibTeX Key: Nemeth+2017","publisher":"Brill","publisher-place":"Leiden","source":"StaBi, OIB","title":"Arabic type-making in the machine age: the influence of technology on the form of Arabic type, 1908-1993","title-short":"Arabic type-making in the machine age","type":"book"},
  {"id":"Nemeth2018ArabicHotMetal","author":[{"family":"Nemeth","given":"Titus"}],"citation-key":"Nemeth2018ArabicHotMetal","container-title":"Philological Encounters","DOI":"10.1163/24519197-12340052","issue":"4","issued":{"date-parts":[[2018]]},"page":"496–523","publisher":"Brill","source":"Google Scholar","title":"Arabic Hot Metal: The Origins of the Mechanisation of Arabic Typography","title-short":"Arabic Hot Metal","type":"article-journal","volume":"3"},
  {"id":"NilssonDombrowski2022MultilingualDH","author":[{"family":"Nilsson-Fernandez","given":"Pedro"},{"family":"Dombrowski","given":"Quinn"}],"citation-key":"NilssonDombrowski2022MultilingualDH","container-title":"The Bloomsbury Handbook to the Digital Humanities","DOI":"10.5040/9781350232143.ch-8","editor":[{"family":"O’Sullivan","given":"James"}],"issued":{"date-parts":[[2022,11,3]]},"language":"en","page":"83-92","publisher":"Bloomsbury","title":"Multilingual Digital Humanities","type":"chapter"},
  {"id":"oclc_4770057679-i_13-div_8.d1e1249","author":[{"family":"Zakham","given":"Yūsuf"}],"citation-key":"oclc_4770057679-i_13-div_8.d1e1249","container-title":"al-Muqtabas","event-place":"Cairo","issue":"1","issued":{"date-parts":[[1907,2,14]]},"language":"ar","note":"date_hijri: 1325-01-01\noclc: 4770057679\noclc: 79440195\nzenodo: 45922152","original-title":"America and Arab Scholars","page":"25-27","publisher-place":"Cairo","title":"Amīrkā wa-ʿulamāʾ al-ʿArab","type":"article-magazine","URL":"https://OpenArabicPE.github.io/journal_al-muqtabas/tei/oclc_4770057679-i_13.TEIP5.xml#div_8.d1e1249","volume":"2"},
  {"id":"oclc_4770057679-i_61-div_21.d1e2838","citation-key":"oclc_4770057679-i_61-div_21.d1e2838","container-title":"al-Muqtabas","issue":"2","issued":{"date-parts":[[1911,2,1]]},"language":"ar","note":"date_hijri: 1329-02-01\noclc: 4770057679\nzenodo: 45922152","original-title":"News and thoughts: Yogurt","page":"133","title":"Akhbār wa afkār: al-laban al-rāʾib","title-short":"al-laban al-rāʾib","type":"article-magazine","URL":"https://OpenArabicPE.github.io/journal_al-muqtabas/tei/oclc_4770057679-i_61.TEIP5.xml#div_21.d1e2838","volume":"6"},
  {"id":"OpenITI2023OpenITICorpus","abstract":"The OpenITI corpus is a open-access and machine-actionable collection of Persian and Arabic texts.","accessed":{"date-parts":[[2023,1,31]]},"author":[{"literal":"OpenITI"}],"citation-key":"OpenITI2023OpenITICorpus","container-title":"Open Islamicate Texts Initiative","issued":{"date-parts":[[2023,1,24]]},"language":"en-US","title":"OpenITI Corpus","type":"webpage","URL":"https://openiti.org/projects/OpenITI%20Corpus.html"},
  {"id":"OpenITIDocumentation","abstract":"The Website for the KITAB project","accessed":{"date-parts":[[2023,1,31]]},"citation-key":"OpenITIDocumentation","container-title":"KITAB","language":"en","title":"OpenITI documentation","type":"webpage","URL":"https://kitab-project-org.github.io/docs/openITI"},
  {"id":"OrtoljaBairdEtAl2019DigitalHumanitiesMemory","abstract":"<p>Catalogues are the core documents of museum structure and meaning. Yet no significant computational analysis has been made of how catalogues from the early modern period are constructed or of the way their structure and content relate to the world from which collections are assembled. The Leverhulme-funded ‘Enlightenment Architectures: Sir Hans Sloane’s catalogues of his collections’ (2016–19), a collaboration between the British Museum and University College London, with contributing expertise from the British Library and the Natural History Museum, seeks to change this. The Enlightenment Architectures project is analysing Sloane’s original manuscript catalogues of his collections to understand their highly complex information architecture and intellectual legacies. In this article we explore some of the challenges of seeking to integrate the methods of digital humanities with those of cataloguing, inventory, curatorial and historical studies and of bringing such interdisciplinary approaches to bear on early modern documentary sources. We do this through two case studies that highlight the approaches to encoding Sloane’s catalogues in TEI that Enlightenment Architectures has employed and the major challenges that these have brought to the fore.</p>","accessed":{"date-parts":[[2023,1,31]]},"author":[{"family":"Ortolja-Baird","given":"Alexandra"},{"family":"Pickering","given":"Victoria"},{"family":"Nyhan","given":"Julianne"},{"family":"Sloan","given":"Kim"},{"family":"Fleming","given":"Martha"}],"citation-key":"OrtoljaBairdEtAl2019DigitalHumanitiesMemory","container-title":"Open Library of Humanities","DOI":"10.16995/olh.409","ISSN":"2056-6700","issue":"1","issued":{"date-parts":[[2019,6,26]]},"language":"en","number":"1","publisher":"Open Library of Humanities","source":"olh.openlibhums.org","title":"Digital Humanities in the Memory Institution: The Challenges of Encoding Sir Hans Sloane’s Early Modern Catalogues of His Collections","title-short":"Digital Humanities in the Memory Institution","type":"article-journal","URL":"https://olh.openlibhums.org/article/id/4581/","volume":"5"},
  {"id":"Petretta2014ArabicSignDesign","abstract":"In the Middle East, the Arabic script is omnipresent and has an ample impact on the built environment. The calligraphic Arabic script is extremely flexible, making its text representation economic. However, in physical signs, calligraphy is replaced by Arabic typography, whose type choices may not capture the full flexibility of the Arabic script. Additionally, the graphic logic of dual language sign systems is not as straightforward when applied in Arabic, since the Arabic reads in two directions: right to left for the script and left to right for the numerals. Multi-script signage involving Arabic requires a heightened sensitivity regarding the information sequence.","accessed":{"date-parts":[[2023,1,25]]},"author":[{"family":"Petretta","given":"Julia"}],"citation-key":"Petretta2014ArabicSignDesign","container-title":"Information Design Journal","DOI":"10.1075/idj.21.1.04pet","ISSN":"0142-5471, 1569-979X","issue":"1","issued":{"date-parts":[[2014,12,31]]},"language":"en","page":"18-33","publisher":"John Benjamins","source":"www.jbe-platform.com","title":"Arabic sign design: Right to left and left to right multi-script wayshowing systems and sign design","title-short":"Arabic sign design","type":"article-journal","URL":"https://www.jbe-platform.com/content/journals/10.1075/idj.21.1.04pet","volume":"21"},
  {"id":"Pohl2022Rasmifize","abstract":"Convert arabic strings to their rasm","accessed":{"date-parts":[[2023,2,24]]},"author":[{"family":"Pohl","given":"Oliver"}],"citation-key":"Pohl2022Rasmifize","genre":"TypeScript","issued":{"date-parts":[[2022,3,1]]},"license":"LGPL-3.0","original-date":{"date-parts":[[2020,9,8]]},"source":"GitHub","title":"rasmifize","type":"software","URL":"https://github.com/suchmaske/rasmifize"},
  {"id":"Qasem+2015","abstract":"# EAP119: periodicals\n\n- when: scanned / photographed in 2007 (sic!)\n- corpus\n    + 24 title: 13 magazines, 11 journals (p. 387) [this should be journals and newspapers]. A table of all titles is provided (p. 394)\n        + including the Ottoman newspaper *taṣvīr-i efkār* ()\n    + selected for rarity and importance of the events they covered (p.387) (this would assume selective digitisation of individual issues)\n    + licence: the facsimiles in this publication are licensed as CC BY (p.390)\n    + details of the digitisation process are not disclosed! I know that there are many blurred photographs among the facsimiles, but this is not mentioned here! This is even more infuriating as this information is provided for EAP399 later in the text (p.403)\n\n# EAP399: manuscripts\n\n- when: scanned in 2010\n\n# author's abstract\n\nThis chapter provides an overview of three digitisation projects supported by the Endangered Archives Programme (EAP). The first, EAP119, digitised the collection of historical periodicals in al-Aqṣá Mosque Library in Jerusalem (Al-Quds) in 2007.2 Two subsequent projects recorded manuscripts in al-Jazzār Mosque Library in Acre (ʿAkkā) (EAP399 in 2010) and al-Aqṣá Mosque Library in Jerusalem (EAP521 in 2012).3 After tracing a short history of the two libraries and outlining the development of the early Arabic press in Palestine, this contribution makes the case for the urgency of digitisation and provides a brief account of the digitisation process along with the challenges that the projects had to overcome.","author":[{"family":"Abu Harb","given":"Qasem"}],"citation-key":"Qasem+2015","container-title":"From Dust to Digital: Ten Years of the Endangered Archives Programme","DOI":"10.11647/OBP.0052.12","editor":[{"family":"Kominko","given":"Maja"}],"issued":{"date-parts":[[2015]]},"language":"en","note":"BibTeX Key: Qasem+2015\ndate_read: 2019-12-16\nuuid: 2A52A3AB-DCFC-4406-88AE-2163B019721F","page":"377-415","publisher":"Open Book Publishers","title":"Digitisation of Islamic manuscripts and periodicals in Jerusalem and Acre","title-short":"Digitisation of Islamic manuscripts and","type":"chapter"},
  {"id":"RaniKumar2019SentimentAnalysisSystem","abstract":"In this article, an innovative approach to perform the sentiment analysis (SA) has been presented. The proposed system handles the issues of Romanized or abbreviated text and spelling variations in the text to perform the sentiment analysis. The training data set of 3,000 movie reviews and tweets has been manually labeled by native speakers of Hindi in three classes, i.e. positive, negative, and neutral. The system uses WEKA (Waikato Environment for Knowledge Analysis) tool to convert these string data into numerical matrices and applies three machine learning techniques, i.e. Naive Bayes (NB), J48, and support vector machine (SVM). The proposed system has been tested on 100 movie reviews and tweets, and it has been observed that SVM has performed best in comparison to other classifiers, and it has an accuracy of 68% for movie reviews and 82% in case of tweets. The results of the proposed system are very promising and can be used in emerging applications like SA of product reviews and social media analysis. Additionally, the proposed system can be used in other cultural/social benefits like predicting/fighting human riots.","accessed":{"date-parts":[[2023,1,26]]},"author":[{"family":"Rani","given":"Sujata"},{"family":"Kumar","given":"Parteek"}],"citation-key":"RaniKumar2019SentimentAnalysisSystem","container-title":"Digital Scholarship in the Humanities","container-title-short":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqy037","ISSN":"2055-7671","issue":"3","issued":{"date-parts":[[2019,9,1]]},"page":"569-581","source":"Silverchair","title":"A sentiment analysis system for social media using machine learning techniques: Social enablement","title-short":"A sentiment analysis system for social media using machine learning techniques","type":"article-journal","URL":"https://doi.org/10.1093/llc/fqy037","volume":"34"},
  {"id":"Risam+2019","author":[{"family":"Risam","given":"Roopika"}],"citation-key":"Risam+2019","DOI":"10.2307/j.ctv7tq4hg","event-place":"Evanston","ISBN":"978-0-8101-3887-2","issued":{"date-parts":[[2019]]},"language":"en","note":"BibTeX Key: Risam+2019\ndate_read: 2020-07\noclc: 1066067721\nuuid: 27835BA8-FBA2-48C6-93C3-F3650E870552","publisher":"Northwestern University Press","publisher-place":"Evanston","source":"WorldCat","title":"New digital worlds: postcolonial digital humanities in theory, praxis, and pedagogy","title-short":"New digital worlds","type":"book","URL":"http://www.jstor.org/stable/10.2307/j.ctv7tq4hg"},
  {"id":"RisamGil2022Introduction","author":[{"family":"Risam","given":"Roopika"},{"family":"Gil","given":"Alex"}],"citation-key":"RisamGil2022Introduction","container-title":"Digital Humanities Quarterly","container-title-short":"DHQ","editor":[{"family":"Gil","given":"Alex"},{"family":"Risam","given":"Roopika"}],"issue":"2,  \"Minimal Computing\"","issued":{"date-parts":[[2022,6,28]]},"language":"en","license":"CC BY-ND 4.0","title":"Introduction: The Questions of Minimal Computing","type":"article-journal","URL":"http://digitalhumanities.org/dhq/vol/16/2/000646/000646.html","volume":"16"},
  {"id":"RockenbachEtAl2014Archives","author":[{"family":"Rockenbach","given":"Ashley Brooke"},{"family":"Bond","given":"Natalie"},{"family":"Taylor","given":"Edgar C."}],"citation-key":"RockenbachEtAl2014Archives","container-title":"African studies in the digital age","DOI":"10.1163/9789004279148_010","editor":[{"family":"Barringer","given":"Terry"},{"family":"Wallace","given":"Marion"}],"event-place":"Leiden","ISBN":"978-90-04-27230-9","issued":{"date-parts":[[2014,7]]},"language":"en","page":"163-178","publisher":"Brill","publisher-place":"Leiden","title":"Archives and the Past: Cataloguing and Digitisation in Uganda’s Archives","type":"chapter"},
  {"id":"Sanni2014West","author":[{"family":"Sanni","given":"Amidu"}],"citation-key":"Sanni2014West","container-title":"African studies in the digital age","DOI":"10.1163/9789004279148_008","editor":[{"family":"Barringer","given":"Terry"},{"family":"Wallace","given":"Marion"}],"event-place":"Leiden","ISBN":"978-90-04-27230-9","issued":{"date-parts":[[2014,7]]},"language":"en","page":"128-147","publisher":"Brill","publisher-place":"Leiden","title":"The West African Manuscript Heritage: Challenges of the Digital Revolution in a Research Economy","type":"chapter"},
  {"id":"Singh+2018+TheMachineIn","abstract":"The decades of 1930s and 40s in which India’s struggle against British rule gained momentum also ushered in critical technological change in the way texts in many Indian languages were materially produced and represented in print. The foremost facilitators of this change were third parties precariously placed in the colonial equation. Focusing on the dilemmas and contradictions of one such concern, the New York-based Mergenthaler Linotype Company and its program for the Devanagari script, this essay examines the mechanics of the power struggle embodied in the process of technological and typographical change. Against the backdrop of India’s independence movement, in deeply contested territories of language and script, the examination of typographical networks that formulated and realized this project throws new light on the richly ambivalent ideological negotiations involved – between popular and academic aspirations, altruistic and commercial enterprises, communal agendas and nationalist politics, and between imperial administration and colonial subjects.","accessed":{"date-parts":[[2021,10,13]]},"author":[{"family":"Singh","given":"Vaibhav"}],"citation-key":"Singh+2018+TheMachineIn","container-title":"Philological Encounters","DOI":"10.1163/24519197-12340051","ISSN":"2451-9197","issue":"4","issued":{"date-parts":[[2018]]},"language":"en","number":"4","page":"469-495","publisher":"Brill; https://web.archive.org/web/20211013183408/http://centaur.reading.ac.uk/75684/","source":"centaur.reading.ac.uk","title":"The machine in the colony: technology, politics, and the typography of Devanagari in the early years of mechanization","title-short":"The machine in the colony","type":"article-journal","URL":"http://centaur.reading.ac.uk/75684/","volume":"3"},
  {"id":"Soualah+2012","abstract":"technical paper, which was not copy-edited. Contains wrong transliteration and obvious Grammatical errors. The suggested solutions seem a bit weird. However, the thoughts on the formalised mark-up of Arabic name components is interesting.","accessed":{"date-parts":[[2012,11,2]]},"author":[{"family":"Soualah","given":"Mohammed Ourabah"},{"family":"Hassoun","given":"Mohamed"}],"citation-key":"Soualah+2012","container-title":"Journal of the Text Encoding Initiative","DOI":"10.4000/jtei.398","issued":{"date-parts":[[2012,2]]},"language":"en","note":"BibTeX Key: Soualah+2012\ndate_read: 2012-11-03\nuuid: 15FDC906-BBAC-4290-A0A0-9DCCDAE71265","source":"jtei.revues.org","title":"A TEI P5 Manuscript Description Adaptation for Cataloguing Digitized Arabic Manuscripts","title-short":"A TEI P5 Manuscript Description","type":"article-journal","URL":"http://jtei.revues.org/398","volume":"2"},
  {"id":"TaghiZadehEtAl2017NewHybridStemming","abstract":"One of the important issues in natural language processing and information retrieval is the automatic extraction of the word’s stem. Both statistical and rule-based approaches for stemming have their own advantages and limitations. The statistical stemmers are not accurate and fail to take advantage of some language phenomenon which can be easily expressed by simple rules. On the other hand, handcrafting the stemming rules in the rule-based stemmers is a time-consuming, tedious, and impractical task. In this regard, we propose a new hybrid stemming method based on a combination of affix stripping and statistical techniques for Persian language. The proposed method combines cues from the orthography, word frequency, and syntactic distributions to induce the stemming rules. In general, the proposed method is divided into two main parts. In the first part, all words of the annotated text corpus are used to automatically induce the stemming rules; while in the second part, the rule-based stemmer uses the induced stemming rules to discover the word's stem. We test the performance of the proposed scheme on two different data sets. The encouraging results indicate the superior performance of the proposed method compared with its counterparts.","accessed":{"date-parts":[[2023,1,26]]},"author":[{"family":"Taghi-Zadeh","given":"Hossein"},{"family":"Sadreddini","given":"Mohammad Hadi"},{"family":"Diyanati","given":"Mohammad Hasan"},{"family":"Rasekh","given":"Amir Hossein"}],"citation-key":"TaghiZadehEtAl2017NewHybridStemming","container-title":"Digital Scholarship in the Humanities","container-title-short":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqv053","ISSN":"2055-7671","issue":"1","issued":{"date-parts":[[2017,4,1]]},"note":"date_read: 2023-01-30","page":"209-221","title":"A new hybrid stemming method for persian language","type":"article-journal","URL":"https://doi.org/10.1093/llc/fqv053","volume":"32"},
  {"id":"TEIP5Guidelines400","abstract":"TEI P5 version 4.0.0 Release 4.0.0 is codenamed ‘Galileo’ in honor of Galileo's arrival to Rome on 13 February 1633 to face the Inquisition. We associate Galileo with decentering the earth in official western dogma of the universe. Similarly, the stand-off model in this release of the TEI Guidelines may serve to decenter our models of digital texts and expand our frames of reference. With the addition of standOff, a significant change in how characters outside of Unicode are described, and the ability of TEI to self-nest, this version is significantly different than previous versions, and thus deserves an increase in the “major” release number. In addition to the stand-off model, this release introduces new features and resolves a number of issues raised by the TEI community. As always, the majority of these changes and corrections are a consequence of feature requests or bugs reported by the TEI community using the GitHub tracking system. A full list of the issues resolved in the course of this release cycle may be found under the 4.0.0 milestone. The following changes are particularly worth highlighting in this release:  The standOff element functions as a container element for linked data, contextual information, and stand-off annotations embedded in a TEI document (#374, thanks to Laurent Romary and Piotr Bański). With the introduction of the standOff element a new structural class model.describedResource has been introduced, and model.resourceLike has been revised and renamed model.resource. As the TEI element is a member of the new model.describedResource class, it can now be a child of another TEI element. The new standOff element:  is a child of TEI (or teiCorpus); may contain stand-off annotations, for example morphosyntactic annotations encoded with spanGrp or annotationBlock; may contain stand-off markup, for example a series of certainty, linkGrp, or alt elements; may contain contextual information, for example listPerson and listPlace; may contain information that must be pointed to from elsewhere, but is not found in the source document, for example a castList that represents characters who speak in a drama, but whose roles are not listed in the source document's printed cast list. New elements, attributes, and an attribute class have been introduced for using Unihan properties in TEI (#1805, thanks to Duncan Paterson):  The attribute class att.gaijiProp provides attributes for defining the properties of non-standard characters or glyphs.  The name attribute provides the name of the character or glyph property being defined. The value attribute provides the value of the character or glyph property being defined. The version attribute specifies the version number of the Unicode Standard in which this property name is defined. A list of suggested values is provided. The localProp element provides a locally defined character (or glyph) property. The unicodeProp element provides a Unicode property for a character (or glyph). The unihanProp element holds the name and value of a normative or informative Unihan character (or glyph) property as part of its attributes. A list of legal values from the Unicode Han Database is provided for the name attribute on unihanProp. The use of the elements charProp, charName, localName, unicodeName, and value has been deprecated. Changes were made to improve the precision of language in the Guidelines referring to conformance (#1588) Multiple Schematron rules, assertions, or reports in a single constraintSpec are now correctly output as a single sch:pattern in the RELAX NG schemas (#1625). The discussion of validation has been updated in A Gentle Introduction to XML (#1708). The attributes mode and ident have been added to the remarks element (#1713). The elements decoNote, explicit, and incipit are now members of the model.biblPart class (#1784). The description of the points attribute in att.coordinated has been clarified (#1789). The xr element is now a member of the attribute class att.typed (#1810). Our use of the Travis continuous integration server has been migrated from travis.org to travis.com (#1826). An example to specify the source of a translation has been added (#1830). The description of manuscript descriptions clarifies that msDesc can be used for all text-bearing objects (#1835). The content model of repository, institution, and collection has been changed from macro.xtext to macro.phraseSeq.limited (#1836). The g element is now available within the zone element (#1838). The placeName element has been added to the class model.settingPart and the example in the setting element has been changed accordingly (#1842). The dateline element is now a member of the class model.pLike.front (#1843). The catDesc element is now a member of the attribute class att.canonical (#1864). A Schematron rule has been added to only allow one remarks element per language in specification files (#1872). The datatype of the name attribute of the attRef element has been changed from teidata.text to teidata.name (#1878). The schema has been tightened to prevent a combination of valList in sequence with other members of model.contentPart (#1862). With the addition of the subtype attribute to the attribute class att.textCritical, subtype is now available on lem, rdg, and rdgGrp (#1867). The content model of teiCorpus has been changed (#1922). The constraints for teidata.word have been loosened to allow any character except Unicode separators or control characters (#1930). The explanation of Relax NG and XPath, together with its associated graphic in the chapter A Gentle Introduction to XML have been revised (#1949). Corrections of typographic errors and broken links, improvements on explanations, and corrections of examples have been conducted in various sections of the Guidelines (including #1760, #1847, #1887, #1907, #1909, #1927, #1936, #1948, #1952, #1954, #1964, #1965, #1968, #1969). Furthermore, a number of translations have been added or updated. In addition, many improvements have been made to the XSLT stylesheets (which provide processing of TEI ODD files for Roma and OxGarage as well as other TEI conversions). The Stylesheets are maintained separately from the Guidelines at https://github.com/TEIC/Stylesheets. A full list of the issues resolved in the course of this release cycle may be found under the 7.49.0 milestone. Highlights of this release include:  The type attribute on biblScope has been replaced by the unit attribute in the tests (#213). Orphaned files in the test directory have been removed (#216). Relative paths to CSS files in the EPUB transformation have been replaced with absolute paths (#312). The jquery library has been updated (#359). Special characters encoded as <w:sym> in DOCX are now converted to hi elements (#389). Correct handling of Schematron rules in attDef elements (#403 and #1950). Finally, we have made some significant updates to our documentation and the website:  Documentation of Council practices in TCW 20 is improved for working with branches in the TEIC GitHub repository #1825. The documentation for updating the TEI Framework in oXygen to the latest release of the TEI Guidelines has been improved #1673 and added to the oxygen-tei repository, see How to automatically update your TEI framework in oXygen. Corrections have been conducted in various sections of the TEI website (including #1944), and #1938.","accessed":{"date-parts":[[2020,7,7]]},"author":[{"literal":"TEI Consortium"}],"citation-key":"TEIP5Guidelines400","DOI":"10.5281/zenodo.3413524","genre":"XML","issued":{"date-parts":[[2020,2,13]]},"publisher":"Zenodo","source":"Zenodo","title":"TEI P5: Guidelines for Electronic Text Encoding and Interchange","title-short":"TEI P5","type":"software","URL":"https://zenodo.org/record/3667251","version":"4.0.0"},
  {"id":"Thylstrup+2018","abstract":"# case studies\n\n- google books\n- europeana\n\n# publisher's abstract\n\n\"Today, anyone with an internet connection can access hundreds of millions of digitized cultural artifacts from the comfort of their desk. And every day cultural institutions and private bodies add thousands of new cultural works to the digital sphere. Mass digitization is forming new central nexuses of knowledge and new ways of engaging with that knowledge. What at first glance appears to be a simple act of digitization (a transformation of singular books from boundary objects to open sets of data), at closer examination reveals a complex process teeming with diverse political, legal, and cultural investments. This book argues that mass digitization has become a global cultural political project. It offers an in-depth examination of mass digitization of cultural memory in the West and beyond. It suggests a new approach to the study of digital cultural memory archives, proposing to understand mass digitization not as neutral technical processes, but rather as distinct subpolitical processes that build new kinds of archives and new ways of interacting with these archives. And it seeks to develop a critical theoretical framework for understanding the new archival apparatuses and the politics and memory dynamics they give rise to.\"--","author":[{"family":"Thylstrup","given":"Nanna Bonde"}],"citation-key":"Thylstrup+2018","event-place":"Cambridge","ISBN":"978-0-262-03901-7","issued":{"date-parts":[[2018]]},"language":"en","note":"BibTeX Key: Thylstrup+2018\ndate_read: 2020\noclc: 1090427862\nuuid: 1BFA26C9-9432-45A5-8151-C919CAEE9260","publisher":"The MIT Press","publisher-place":"Cambridge","source":"WorldCat","title":"The politics of mass digitization","type":"book"},
  {"id":"VeisiEtAl2020KurdishLanguageProcessing","abstract":"In this article, we introduce the first Kurdish text corpus for Central Kurdish (Sorani) branch, called AsoSoft text corpus. Kurdish language, which is spoken by more than 30 million people, has various dialects. As one of the two main branches of Kurdish, Central Kurdish is the formal dialect of Kurdish literature. AsoSoft text corpus is of size 188 million tokens and has been collected mostly from Web sites, published books, and magazines. The corpus has been normalized and converted into Text Encoding Initiative XML format. In both collecting and processing the text, we have faced several challenges and have proposed solutions to them. About 22% of the corpus is topic annotated with six topic tags, and a topic identification task has been done to evaluate the correctness of annotation. The computational experiments of the Central Kurdish text processing are also presented with the support of related supplementary statistics. For the first time, the validity of Zipf’s law for Central Kurdish is presented and also perplexity of this language is calculated using standard N-gram language models. The perplexity of Central Kurdish is 276 for a tri-gram language model.","accessed":{"date-parts":[[2023,1,26]]},"author":[{"family":"Veisi","given":"Hadi"},{"family":"MohammadAmini","given":"Mohammad"},{"family":"Hosseini","given":"Hawre"}],"citation-key":"VeisiEtAl2020KurdishLanguageProcessing","container-title":"Digital Scholarship in the Humanities","container-title-short":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqy074","ISSN":"2055-7671","issue":"1","issued":{"date-parts":[[2020,4,1]]},"note":"date_read: 2023-01-30","page":"176-193","title":"Toward Kurdish language processing: Experiments in collecting and processing the AsoSoft text corpus","title-short":"Toward Kurdish language processing","type":"article-journal","URL":"https://doi.org/10.1093/llc/fqy074","volume":"35"},
  {"id":"Verkinderen+2020+AlMaktabaAlShamilaShort","accessed":{"date-parts":[[2020,12,22]]},"author":[{"family":"Verkinderen","given":"Peter"}],"citation-key":"Verkinderen+2020+AlMaktabaAlShamilaShort","container-title":"KITAB","issued":{"date-parts":[[2020,12,3]]},"language":"en-US","title":"Al-Maktaba al-Shāmila: a short history","title-short":"Al-Maktaba al-Shāmila","type":"post-weblog","URL":"http://kitab-project.org/2020/12/03/al-maktaba-al-shamila-a-short-history/"},
  {"id":"W3CUnicodeBiDiBasics","accessed":{"date-parts":[[2023,2,9]]},"author":[{"family":"Ishida","given":"Richard"}],"citation-key":"W3CUnicodeBiDiBasics","container-title":"W3C Internationalization (I18n)","issued":{"date-parts":[[2016,8,9]]},"title":"Unicode Bidirectional Algorithm basics","type":"webpage","URL":"https://www.w3.org/International/articles/inline-bidi-markup/uba-basics"},
  {"id":"WilsonBlack2022CreatingSpecializedCorpora","abstract":"The availability of large digital archives of historical newspaper content has transformed the historical sciences. However, the scale of these archives can limit the direct application of advanced text processing methods. Even if it is computationally feasible to apply sophisticated language processing to an entire digital archive, if the material of interest is a small fraction of the archive, the results are unlikely to be useful. Methods for generating smaller specialized corpora from large archives are required to solve this problem. This article presents such a method for historical newspaper archives digitized using the METS/ALTO XML standard (Veridian Software, n.d.). The method is an ‘iterative bootstrapping’ approach in which candidate corpora are evaluated using text mining techniques, items are manually labelled, and Naïve Bayes text classifiers are trained and applied in order to produce new candidate corpora. The method is illustrated by a case study that investigates philosophical content, broadly construed, in pre-1900 English-language New Zealand newspapers. Extensive code is provided in Supplementary Materials.","accessed":{"date-parts":[[2023,1,26]]},"author":[{"family":"Wilson Black","given":"Joshua"}],"citation-key":"WilsonBlack2022CreatingSpecializedCorpora","container-title":"Digital Scholarship in the Humanities","container-title-short":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqac079","ISSN":"2055-7671","issue":"fqac079","issued":{"date-parts":[[2022,12,22]]},"page":"1-19","source":"Silverchair","title":"Creating specialized corpora from digitized historical newspaper archives: An iterative bootstrapping approach","title-short":"Creating specialized corpora from digitized historical newspaper archives","type":"article-journal","URL":"https://doi.org/10.1093/llc/fqac079"},
  {"id":"WorldWritingSystems","abstract":"This web site presents one reference glyph and basic information for each of the world’s writing systems. It is the first step of the Missing Scripts Project, a long-term initiative that aims to identify writing systems which are not yet encoded in the Unicode standard. As of today, there are still 131 scripts not yet encoded in Unicode. So they can’t be used on the computer — yet.\n\nThe Missing Scripts Project is a joint effort of\n\nAtelier National de Recherche Typographique (ANRT), Nancy, France\n\nInstitut Designlabor Gutenberg (IDG), Hochschule Mainz, Germany\n\nScript Encoding Initiative (SEI), Department of Linguistics, UC Berkeley, USA","accessed":{"date-parts":[[2023,2,28]]},"citation-key":"WorldWritingSystems","container-title":"The World’s Writing Systems","issued":{"date-parts":[[2022,9]]},"language":"en","title":"Project","type":"webpage","URL":"https://www.worldswritingsystems.org/project.html"},
  {"id":"Zaagsma2022Politics","abstract":"Much has been made in recent years of the transformative potential of digital resources and historical data for historical research. Historians seem to be ﬂooded with retro-digitized and born-digital materials and tend to take these for granted, grateful for the opportunities they afford. In a research environment that increasingly privileges what is available online, the questions of why, where, and how we can access what we can access, and how it affects historical research have become ever more urgent. This article proposes a framework through which to contextualize the politics of (digital) heritage preservation, and a model to analyse its most important political dimensions, drawing upon literature from the digital humanities and history as well as archival, library, and information science. The ﬁrst part will outline the global dimensions of the politics of digital cultural heritage, focusing on developments between and within the Global North and South, framed within the broader context of the politics of heritage and its preservation. The second part surveys the history and current state of digitization and offers a structured analysis of the process of digitization and its political dimensions. Choices and decisions about selection for digitization, how to catalogue, classify, and what metadata to add are all political in nature and have political consequences, and the same is true for access. The article concludes with several recommendations and a plea to acknowledge the importance of digital cataloguing in enabling access to the global human record.","accessed":{"date-parts":[[2022,12,9]]},"author":[{"family":"Zaagsma","given":"Gerben"}],"citation-key":"Zaagsma2022Politics","container-title":"Digital Scholarship in the Humanities","DOI":"10.1093/llc/fqac050","ISSN":"2055-7671, 2055-768X","issued":{"date-parts":[[2022,9,16]]},"language":"en","license":"CC BY-NC 4.0","page":"fqac050","source":"DOI.org (Crossref)","title":"Digital History and the Politics of Digitization","type":"article-journal","URL":"https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqac050/6702047"},
  {"id":"Zaccaria2014Recovering","author":[{"family":"Zaccaria","given":"Massimo"}],"citation-key":"Zaccaria2014Recovering","container-title":"African studies in the digital age","DOI":"10.1163/9789004279148_009","editor":[{"family":"Barringer","given":"Terry"},{"family":"Wallace","given":"Marion"}],"event-place":"Leiden","ISBN":"978-90-04-27230-9","issued":{"date-parts":[[2014,7]]},"language":"en","page":"148-162","publisher":"Brill","publisher-place":"Leiden","title":"Recovering the African Printed Past: Virtually Re-membering a Dispersed Collection in Eritrea","type":"chapter"}
]
